package lesson1;

import java.util.Arrays;
import java.util.Scanner;

public class MyFirstClass {
    public static void main(String[] args) {

        // Написать приложение, которое будет вычислять и выводить значение по формуле:
        // a=4*(b+c-1)/2; b и c задаем в коде самостоятельно
        int b = 3;
        int c = 5;

        int a = 4 * (b + c - 1) / 2;
        System.out.println(a);
        System.out.println(a);
    }
}








